#*************************************************************************
#	Appli	：HTML Help Workshop補助ツール
#	Module	：hhkファイルよりキーワードリストを生成
#	File	：hhk2kwl.pl
#	Date	：2006-12-05
#	Author	：石川達也
#*************************************************************************
#=========================================================================
#	機能
#=========================================================================
#	■概要
#	　HTML Help Workshopで使用するインデックスキーファイル(.hhk)を解析し
#	kwlファイル形式に変換します。
#
#	■書式
#	　perl hhk2kwl.pl [hhkファイル] > [kwl.ファイル]
#
#	　[hhkファイル]……解析するインデックスキーファイル
#	　[kwlファイル]……出力するkwlファイル
#
#-------------------------------------------------------------------------
#	変更履歴
#-------------------------------------------------------------------------
#	2006-12-05	新規作成
#-------------------------------------------------------------------------
#=========================================================================
#	メイン
#=========================================================================
# hhkファイル名取得
$hhkfile = $ARGV[0];
if ($hhkfile eq "") {
	die("hhkファイルを指定してください。\n");
}

# hhk読み込み
if (!open( HHK, $hhkfile)) {
	die("hhkファイルの読み込みに失敗しました。\n");
}

while(<HHK>) {
	$line = $_;
	if ($line =~ /<LI>/) {
		# 行頭の半角スペース数カウント
		$tmp = $line;
		$tmp =~ s/^\s*//g;
		$count = (length($line)) - (length($tmp));
	}
	else {
		next;
	}
	print_indent($count);
	if ($line =~ m%param\s*name="See Also"\s*value="(.+?)"%i) {
		$dir = $1;
	}
	if ($line =~ m%param\s*name="Local"\s*value="(.+?)"%i) {
		$local = $1;
	}
	if ($line =~ m%param\s*name="Name"\s*value="(.+?)"%i) {
		$name = $1;
	}
	if ($dir eq $name) {
		print "\"$dir\"\n";
	}
	else {
		print "\"$name\" \"$local\"\n";
	}
}

close(HHK);
exit();

#=========================================================================
#	サブルーチン
#=========================================================================
#-------------------------------------------------------------------------
#	インデント追加
#-------------------------------------------------------------------------
sub print_indent {
	my ($count) = @_[0];

	for ($i = 0; $i < (($count-2)/2); $i++) {
		print "\t";
	}
}