#*************************************************************************
#	Appli	：HTML Help Workshop補助ツール
#	Module	：キーワードリストよりhhkファイルを作成
#	File	：kwl2hhk.pl
#	Date	：2006-12-04
#	Author	：石川達也
#*************************************************************************
#=========================================================================
#	機能
#=========================================================================
#	■概要
#	　kwlファイルをHTML Help Workshopで使用するインデックスキーファイル(.hhk)
#	に変換します。
#
#	■書式
#	　perl kwl2hhk.pl [kwlファイル] > index.hhk
#
#	　[kwlファイル]……kwlgenなどで生成した追加するキーワードの列挙さ
#	　　　　　　　　　れているファイル
#	　　　　　　　　（※kwlファイル内では空行を使用しないで下さい。）
#
#-------------------------------------------------------------------------
#	変更履歴
#-------------------------------------------------------------------------
#	2006-12-04	新規作成
#-------------------------------------------------------------------------
#=========================================================================
#	メイン
#=========================================================================
#	キーワードリストファイル名取得
$kwlfile = $ARGV[0];
if ($kwlfile eq "") {
	die("キーワードリストを指定してください。\n");
}

# キーワードリスト読み込み
if (!open(KWL, $kwlfile)) {
	die("キーワードリストの読み込みに失敗しました。\n");
}

# ヘッダ出力
print_header();

$nest  = 0;	#	深さ
$nLoop = 0;	#	キーワードリストファイルの行数
while( <KWL> ) {
	$nLoop++;
	# 空行来たらEND
	if ($_ eq "\n") {
		die("$nLoop行目：空行があります。\n");
	}

	# \t数える
	$count = ($_ =~ s/\t/\t/g);
	if ($count eq "") {
		$count = 0;
	}

	$_ =~ s/^\t*//;		# 数え終わったら行頭の\t削除
	$_ =~ s/\n//;		# 改行削除
	$line = $_;
	if ($line =~ m%"(.+?)"\s+?"(.+?)"%i) {
		$name = $1;	# 名前
		$file = $2;	# リンク先
	}
	elsif ($line =~ m%"(.+?)"%i) {
		$name = $1;	# 名前
		$file = "";	# リンク先
	}

	if ($nest > $count) {
		for (; $nest > $count; $nest--) {
			print_indent($nest-1);
			print "</UL>\n";
		}
	}
	elsif ($nest < $count) {
		for (; $nest < $count; $nest++) {
			print_indent($nest);
			print "<UL>\n";
		}
	}

	if ($file eq "") {
		print_indent($count);
		print "<LI><OBJECT type=\"text/sitemap\">";
		print "<param name=\"See Also\" value=\"$name\">";
		print "<param name=\"Name\" value=\"$name\">";
		print "</OBJECT>\n";
	}
	else {
		print_indent($count);
		print "<LI><OBJECT type=\"text/sitemap\">";
		print "<param name=\"Local\" value=\"$file\">";
		print "<param name=\"Name\" value=\"$name\">";
		print "</OBJECT>\n";
	}
}
close(KWL);

#	閉じ
for (; $nest > 0; $nest--) {
	print_indent($nest-1);
	print "</UL>\n";
}

# フッタ出力
print_footer();

exit();

#=========================================================================
#	サブルーチン
#=========================================================================
#-------------------------------------------------------------------------
#	インデント追加
#-------------------------------------------------------------------------
sub print_indent {
	my ($count) = @_[0];

	for ($i = 0; $i < ($count+1); $i++) {
		print "  ";
	}
}

#-------------------------------------------------------------------------
#	ヘッダ出力
#-------------------------------------------------------------------------
sub print_header {
print <<_HEADER_
<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">
<HTML><HEAD></HEAD><BODY>
<OBJECT type="text/site properties">
<param name="FrameName" value="right">
</OBJECT>
<UL>
_HEADER_
;
}

#-------------------------------------------------------------------------
#	フッタ出力
#-------------------------------------------------------------------------
sub print_footer {
print <<_FOOTER_
</UL>
</BODY></HTML>
_FOOTER_
;
}
